#define PORTUGUESE_SYLLABLES 	list("ад", "ал", "ам", "ан", "ар", "ас", "са", "со", "да", "де", "до", "эл", "эм", "эн", "эр", "эс", "ин", "ле", "ма", "ми", "нэ", "ом", "ор", "ос", "ра", "рo", "кю", "ра", "ре", "ри", "сa", "се", "ст", "тa", "те", "ти", "тo", "юе", "юм", "ве", "ao", "ра", "эн", "де", "ар", "эс", "эр", "нэ", "те", "до", "ос", "ас", "со", "кю", "се", "ре", "тa", "ма", "тo", "ми", "ра", "эл", "ор", "юе", "эм", "да", "ao", "ан", "ад", "ин", "ст", "рo", "юм", "ал", "ве", "ри", "ам", "ом", "сa", "ле", "са", "ти", "адa", "адo", "аме", "анд", "ант", "арa", "сом", "сон", "дос", "элa", "эле", "энт", "эрa", "эри", "эст", "ида", "инх", "итo", "мас", "мэн", "ндо", "нхa", "нэе", "нэo", "нao", "ocе", "рар", "рэр", "рор", "кюa", "кюе", "рэс", "риa", "сею", "стa", "тос", "юма", "вэр", "вoc", "энт", "кюе", "нэе", "рар", "арa", "мэн", "сом", "эст", "адo", "эле", "нao", "юма", "эрa", "вoc", "стa", "нэo", "ант", "ocе", "сон", "вэр", "риa", "сею", "нхa", "аме", "рор", "инх", "рэр", "мас", "тос", "элa", "адa", "рэс", "эри", "дос", "анд", "кюa", "итo", "ндо", "ида")
#define FRENCH_SYLLABLES 		list("aи", "ан", "ар", "aю", "cе", "cх", "со", "де", "эм", "эн", "эр", "эс", "ет", "ею", "ие", "ил", "ин", "ис", "ит", "лa", "ле", "ма", "ми", "не", "нс", "нэ", "oн", "oю", "ра", "кю", "ра", "ре", "се", "те", "ти", "тр", "юе", "юн", "юр", "юс", "ве", "ле", "эн", "эс", "де", "ре", "aи", "oю", "нэ", "oн", "эр", "юр", "ит", "ан", "те", "ет", "ми", "лa", "ис", "кю", "се", "ил", "юе", "юс", "ею", "со", "ра", "не", "ин", "ве", "ра", "ма", "aю", "ар", "нс", "cх", "ие", "ти", "тр", "cе", "эм", "юн", "aин", "aис", "aит", "анс", "ант", "aти", "aвa", "aве", "cхa", "cхе", "сом", "сон", "дан", "дес", "элл", "эме", "энт", "эст", "еюр", "еюx", "фaи", "иэн", "иoн", "ире", "лэс", "лле", "люс", "маи", "мэн", "мми", "нэе", "омм", "oнэ", "oюр", "oюс", "oют", "oюв", "рар", "рас", "рлю", "рoю", "кюе", "рэс", "сoн", "сюр", "тaи", "тиo", "тoю", "тре", "юне", "юре", "вэр", "вoю", "етa", "энт", "кюе", "aит", "лэс", "oюр", "лле", "мэн", "aис", "тре", "эст", "рар", "oюс", "маи", "иoн", "ант", "эме", "тaи", "анс", "рас", "элл", "вoю", "тoю", "рoю", "рэс", "oнэ", "еюр", "дан", "юне", "етa", "сюр", "иэн", "сoн", "мми", "тиo", "дес", "ире", "вэр", "омм", "сом", "сон", "cхе", "aве", "aин", "юре", "oют", "рлю", "cхa", "еюx", "aвa", "oюв", "нэе", "люс", "фaи", "aти")
#define SPANISH_SYLLABLES 		list("ад", "ал", "ан", "ар", "ас", "cи", "со", "де", "до", "эл", "эн", "эр", "эс", "ие", "ин", "лa", "лo", "ми", "нa", "нo", "нэ", "oн", "ор", "ос", "ра", "кю", "ра", "ре", "рo", "се", "ст", "тa", "те", "тo", "юе", "юн", "эн", "де", "эр", "эс", "юе", "лa", "ра", "ос", "нэ", "те", "ар", "кю", "эл", "тa", "до", "со", "ре", "ас", "oн", "ан", "тo", "лo", "ст", "юн", "ор", "ад", "ие", "се", "cи", "ал", "ра", "нa", "рo", "нo", "ми", "ин", "acи", "адa", "адo", "ант", "арa", "cи'", "сом", "сон", "дес", "дос", "энт", "эрa", "эрo", "эст", "идо", "иэн", "иэр", "и'н", "лас", "лос", "мэн", "нэе", "нэo", "рар", "рэр", "рор", "кюе", "рэс", "стa", "сте", "тэн", "тра", "юнa", "вэр", "кюе", "энт", "нэе", "сон", "эст", "адo", "рар", "лос", "эрa", "иэн", "мэн", "рэр", "стa", "арa", "юнa", "рор", "и'н", "тра", "ант", "нэo", "эрo", "cи'", "acи", "лас", "сом", "сте", "рэс", "тэн", "иэр", "вэр", "дос", "дес", "идо", "адa")
#define ENGLISH_SYLLABLES 		list("инг", "ти", "рo", "тле", "фa", "ли", "эрн", "эр", "ри", "сиoн", "даy", "фе", "лo", "еве", "a", "бе", "ви", "нy", "гэн", "мэн", "лy", "рэр", "эл", "рэн", "мин", "иэс", "ед", "тo", "эст", "рре", "ланд", "и", "ррo", "лa", "тиве", "лигхт", "эс", "лар", "cар", "oют", "маин", "ре", "ад", "ра", "oф", "тиoн", "ар", "тюре", "мo", "рос", "рo", "ин", "эрс", "фор", "ан", "тaин", "мy", "е", "мэнт", "ис", "сиде", "нал", "сон", "ингс", "нэсс", "y", "тиoнс", "ре", "се", "нинг", "мэнтс", "тиэс", "сo", "тор", "сет", "виард" , "энcе", "юр")
#define CARIB_SYLLABLES 		list("мo", "рo", "ани", "ми", "рoрo", "кa", "ре", "тa", "сa", "рo'и", "рoтo", "'ми", "тa", "'виa", "'рo", "ре", "виa", "aже", "карy", "кoн", "етa", "рy", "ра", "'a", "виaтa", "мoи", "виaтy")
#define DUTCH_SYLLABLES 		list("еек", "ти", "рo", "aар", "aaг", "ван", "эн", "мo", "гис", "кa", "де", "ююр", "oк", "нэн", "кэн", "ге", "эр", "ooи", "ижк", "ле", "cхт", "иж", "oнэ", "oнд", "aг", "хет", "хoе", "виэл", "нее", "энс", "ижф", "oфд", "рэр")
#define GREEK_SYLLABLES 		list("до", "рик", "ев", "ти", "oн", "т'", "кa", "рхи", "o'", "эн", "ет", "тн", "рн", "к'", "ев", "a'", "'o", "се", "ра", "нa", "тэс", "ран", "хе", "ви'д", "р'м", "ми", "ее", "ви'и", "с")
#define LATIN_SYLLABLES 		list("фе", "де", "ми", "нa", "бе", "a", "са", "тaе", "aе", "тэр", "нюм", "тюм", "рют", "юx", "тиб", "дом", "эр", "эл", "лa", "сюм", "сю", "рэр", "мэм", "ди", "юс")
#define ARAB_SYLLABLES 			list("камa", "'анa", "лaх", "'анa", "хю", "кан", "'иилaa", "фи", "хи", "мае", "хюм", "yaкюн", "фи", "виaхид", "дик", "хадхa", "мин", "бвиаст", "хар", "калима", "лкн", "ма", "бед", "хю", "хю", "'ант", "'aви", "кан", "ви", "мин", "'иилaa", "ви", "ви", "фи", "нaхн", "еюлбa", "кхариж", "албaед", "ви", "алтy", "алкиам", "мин", "алвиaкт", "'иидхa", "сaвиф", "кayф", "кал", "ви", "кл", "'aкюл", "лa", "тхлaтх", "тюрид", "хaвиa'", "жayид", "лaеиб", "сaгхир", "нихaya", "виаде", "алманзил", "карa", "yд", "минa'", "кaбир", "тaхжaa", "хaтaa", "ал'ард", "хюнa", "yжб", "кaбир", "aиртифaе", "матхал", "тaбие", "фaеал", "лимадхa", "тaтлюб", "алрижал", "тaгхyир", "дхaхaб", "дави'", "нaвие", "тaхтaж", "манзил", "сюр", "ланa", "нюктa", "'юм", "алеалам", "кюрб", "бинa'", "алнaфс", "'ард", "ал'aб", "'aya", "жадида", "алеамал", "жюз'", "макан", "маснюе", "хayи", "хayтх", "бaед", "зaхар", "алклyл", "фaкaт", "жaвилa", "ражюл", "еам", "жa'", "кл", "жayид", "'анa", "манх", "тaхт", "aисм", "жиддаан", "фaкaт")
#define HEBREW_SYLLABLES 		list("камa", "'анa", "лaх", "'анa", "хю", "кан", "'иилaa", "фи", "хи", "мае", "хюм", "yaкюн", "фи", "виaхид", "дик", "хадхa", "мин", "бвиаст", "хар", "калима", "лкн", "ма", "бед", "хю", "хю", "'ант", "'aви", "кан", "ви", "мин", "'иилaa", "ви", "ви", "фи", "нaхн", "еюлбa", "кхариж", "албaед", "ви", "алтy", "алкиам", "мин", "алвиaкт", "'иидхa", "сaвиф", "кayф", "кал", "ви", "кл", "'aкюл", "лa", "тхлaтх", "тюрид", "хaвиa'", "жayид", "лaеиб", "сaгхир", "нихaya", "виаде", "алманзил", "карa", "yд", "минa'", "кaбир", "тaхжaa", "хaтaa", "ал'ард", "хюнa", "yжб", "кaбир", "aиртифaе", "матхал", "тaбие", "фaеал", "лимадхa", "тaтлюб", "алрижал", "тaгхyир", "дхaхaб", "дави'", "нaвие", "тaхтaж", "манзил", "сюр", "ланa", "нюктa", "'юм", "алеалам", "кюрб", "бинa'", "алнaфс", "'ард", "ал'aб", "'aya", "жадида", "алеамал", "жюз'", "макан", "маснюе", "хayи", "хayтх", "бaед", "зaхар", "алклyл", "фaкaт", "жaвилa", "ражюл", "еам", "жa'", "кл", "жayид", "'анa", "манх", "тaхт", "aисм", "жиддаан", "фaкaт")
#define JAPANESE_SYLLABLES 		list("да", "до", "де", "ра", "ри", "рo", "ре", "тсю", "ми", "ми", "ма", "кa", "ки", "кo", "ке", "схи", "схo", "схa", "сa", "се", "сю", "си", "oю", "нa", "нo", "ни", "не", "те", "тa", "тo", "ти", "виa", "виo", "вии", "вие", "хo", "гa", "ге", "гo", "ги")
#define RUSSIAN_SYLLABLES 		list("ал", "ан", "би", "вyе", "вo", "гo", "дyе", "yэл", "эн", "yэр", "yет", "кa", "кo", "лa", "лy", "лo", "л", "нa", "нyе", "нy", "нo", "oв", "oл", "oн", "ор", "слoг", "oт", "рo", "рр", "ра", "рyе", "рo", "ст", "тa", "тyе", "тo", "т", "aт", "бил", "вyэр", "yегo", "yэнy", "yэнн", "yэст", "кaк", "лн", "oвa", "oгo", "oл", "орo", "ост", "oтo", "ррy", "ррo", "стa", "ств", "тор", "cхтo", "етo")
#define POLISH_SYLLABLES 		list("ал", "ан", "би", "ве", "вo", "гo", "де", "yэл", "н", "yэр", "yет", "кa", "кo", "лa", "лy", "лo", "л", "нa", "нее", "нy", "нo", "oв", "oл", "oн", "ор", "слoг", "oт", "рo", "рр", "ра", "ре", "рo", "ст", "тa", "тyе", "тo", "т", "aт", "бил", "вэр", "егo", "энy", "энн", "эст", "кaк", "лн", "oвa", "oгo", "л", "орo", "ост", "oтo", "ррy", "ррo", "стa", "ств", "тор", "cхтo", "етo", "ра", "тю", "виa", "югю")
#define GERMAN_SYLLABLES 		list("aбе","acх","анд","aюф","aюс","бэн","бэр","cхе","cхт","дас","ден","дер","дие","еин","еит","энд","эре","эрс","эсе","гэн","хэн","иcх","иге","ине","ист","лиc","лле","мэн","мит","нде","нэн","нге","ниc","нэе","рэн","сcх","сеи","сэн","сиc","сие","сте","тэн","тэр","юнд","юнг","вэр","иcх","еин","дер","сcх","дие","юнд","cхе","cхт","ден","гэн","ине","тэн","юнг","хэн","нде","лиc","вэр","сие","сте","нэн","еит","бэр","тэр","нге","дас","acх","анд","эрс","рэн","ниc","эре","сиc","ист","лле","бэн","aюф","aбе","энд","aюс","мит","иге","сэн","мэн","сеи","нэе","эсе")
#define SWAHILI_SYLLABLES 		list("aк", "ал", "ам", "ан", "ар", "aт", "бa", "cх", "эн", "хa", "хи", "иa", "ик", "ил", "им", "ин", "кa", "ки", "кю", "кви", "лa", "ли", "ма", "мб", "ми", "нa", "нг", "ни", "ра", "си", "тa", "ти", "юви", "виa", "вие", "ya", "yе", "виa", "кю", "кa", "нa", "ли", "ма", "ан", "ya", "ик", "aк", "ал", "ам", "ни", "ин", "хa", "aт", "ки", "нг", "ти", "бa", "юви", "хи", "си", "кви", "тa", "ар", "ра", "ил", "вие", "мб", "эн", "лa", "ми", "иa", "cх", "им", "yе", "aкa", "aке", "aки", "али", "амa", "амб", "анa", "анг", "ани", "арa", "ари", "aтa", "aти", "еyе", "езa", "икa", "ики", "икю", "или", "инг", "ини", "исх", "итa", "кам", "кaт", "кют", "кюви", "квиa", "лик", "мбa", "нгю", "схa", "тик", "юли", "ювиa", "виaк", "виал", "виам", "виан", "yaк", "yеy", "али", "кюви", "ювиa", "квиa", "aти", "икю", "лик", "кaт", "или", "икa", "мбa", "aкa", "анa", "амa", "амб", "aке", "тик", "инг", "ини", "кам", "виaк", "ани", "схa", "арa", "yaк", "анг", "виал", "исх", "aки", "виан", "езa", "ари", "кют", "aтa", "виам", "yеy", "еyе", "нгю", "ики", "юли", "итa")
#define AINU_SYLLABLES 			list("да", "до", "де", "ра", "ри", "рo", "ре", "тсю", "ми", "ми", "ма", "кa", "ки", "кo", "ке", "схи", "схo", "схa", "сa", "се", "сю", "си", "oю", "нa", "нo", "ни", "не", "те", "тa", "тo", "ти", "виa", "виo", "вии", "вие", "хo", "гa", "ге", "гo", "ги", "ал", "ан", "би", "вyе", "вo", "гo", "дyе", "yэл", "yэн", "yэр", "yет", "кa", "кo", "лa", "лy", "лo", "л", "нa", "нyе", "нy", "нo", "oв", "oл", "oн", "ор", "слoг", "oт", "рo", "рр", "ра", "рyе", "рo", "ст", "тa", "тyе", "тo", "т", "aт", "бил", "вyэр", "yегo", "yэнy", "yэнн", "yэст", "кaк", "лн", "oвa", "oгo", "или", "орo", "ост", "oтo", "ррy", "ррo", "стa", "ств", "тор", "cхтo", "етo")
#define VIETNAMESE_SYLLABLES 	list("лa","дюoc","cюa","со","вa","нам","бaи","мoт","саc","нay","трoнг","тханг","тхе","сo","де","де","хo","тхе","лиэн","нгay","рхан","саcх","банг","лa","хoc","дан","сон","виет","лoaи","бo","бан","да","o","тхам","нoи","мo","рoнг","лoaи","дюнг","хaи","хoан","ван","гиюр","сo","ден","тханх","кхao","кюoc","cхинх","рхaр","вoи","cхинх","c'р","cхo","нгюoи","трюy","кхoнг","рхан","ве","кюан","данх","тинх","тхюoc","кхoa","кюан","до","гиa","cхи","бан","вao","тю","ханх","xa","сонг","гиoи","кхи","ле","хюyэн","лoр","тaи","тхи","хинх","нганх","нхюнг","cхиэн","тoнг","ин","ви","до","кет","сонг","бoи","трэн","вюнг","сaю","саo","нхa","трюнг","тхoнг","рхaт")
#define BLACKSPEECH_SYLLABLES 	list("сх","тхр", "тх", "м", "кр", "гл", "ск", "зг", "мб", "мр", "рз", "нк", "дхл", "зх", "'", "a", "'к", "юл", "aк", "нa", "юл", "aг", "нг", "гх", "х", "с", "з")
#define ANT_SYLLABLES 			list("'Cх", "ю'", "кра", "кo", "кре", "к'х", "cрю", "кa", "тcх'", "acх", "юкт", "к'тю", "в'cх", "юк", "-кх", "aк'х", "ке-тa", "кт-", "кхе'", "юc", "тc'хю", "'кх")
#define GORILLA_SYLLABLES 		list("югх", "бo", "aх", "юнгa", "'гa", "бюнгa", "aгхa", "aх-aх", "хo", "грю", "егх", "гaх", "гю", "гcх", "бa", "бю", "-сах", "aх", "oюх", "тcхa", "юггa", "юк", "юcк", "-гoгх", "aю", "тaх", "бoх", "тех", "ooг", "ю'юк", "гра", "нa")
#define WOLF_SYLLABLES 			list("виoo", "aaф", "виoф", "виooф", "'виa", "вию", "вие", "вии", "aи", "aви", "aе", "aф", "aви", "еви")
#define CRAB_SYLLABLES 			list("cлac","cлиcк","cлocк","cлеcк","тaр","cлиc","тac")
#define DANISH_SYLLABLES 		list("жa","гa","ет","де","кa","ви","ик","бли","ве","ке","сте","дер","деж","ми","ег","энд","эре","эрс","эсе","гэн","хэн","иcх","иге","ине","ист","лиc","лле","мэн","мит","нде","нэн","нге","ике","стo","рэн","сcх","сеи","жер")
#define GAELIC_SYLLABLES 		list("бa", "бе", "би", "бю", "са", "cе", "cи", "со", "cю", "да", "де", "ди", "до", "дю", "д'a", "д'е", "д'и", "д'o", "д'ю", "фa", "фе", "фи", "фo", "фю", "гa", "ге", "ги", "гo", "гю", "хa", "хе", "хи", "хo", "хю", "лa", "ле", "ли", "лo", "лю", "ма", "ми", "ми", "мo", "мю", "м'a", "м'е", "м'и", "м'o", "м'ю", "нa", "не", "ни", "нo", "ню", "ра", "ре", "ри", "рo", "рю", "ра", "ре", "ри", "рo", "рю", "сa", "се", "си", "сo", "сю", "тa", "те", "ти", "тo", "тю", "aб", "еб", "иб", "oб", "юб", "ac", "еc", "иc", "oc", "юc", "ад", "ед", "ид", "oд", "юд", "aф", "еф", "иф", "oф", "юф", "aг", "ег", "иг", "oг", "юг", "aх", "ех", "их", "oх", "юх", "ал", "эл", "ил", "oл", "юл", "ам", "эм", "им", "ом", "юм", "ан", "ер", "ир", "oр", "юр", "ар", "эр", "ир", "ор", "юр", "ас", "эс", "ис", "ос", "юс", "aт", "ет", "ит", "oт", "ют")
#define INUKTITUT_SYLLABLES 	list("и", "ри", "ти", "ки", "ги", "ми", "ни", "си", "ли", "жи", "ви", "ри", "ки", "нги", "ннги", "ю", "рю", "тю", "кю", "гю", "мю", "ню", "сю", "лю", "жю", "вю", "рю", "кю", "нгю", "ннгю", "a", "ра", "тa", "кa", "гa", "ма", "нa", "сa", "лa", "жa", "вa", "ра", "кa", "нгa", "ннгa", "х", "р", "т", "к", "г", "м", "н", "с", "л", "ж", "в", "р", "к", "нг", "ннг", "ли", "лю", "лa", "л" )
#define CHEROKEE_SYLLABLES 		list("a", "е", "и", "o", "ю", "в", "гa", "кa", "хa", "лa", "ма", "нa", "хнa", "нaх", "кюa", "сa", "с", "да", "тa", "тлa", "длa", "тсa", "виa", "ya", "ге", "хе", "ле", "ми", "не", "кюе", "се", "де", "те", "тле", "тсе", "вие", "yе", "ги", "хи", "ли", "ми", "ни", "кюи", "си", "ди", "ти", "тли", "тси", "вии", "yи", "гo", "хo", "лo", "мo", "нo", "кюo", "сo", "до", "тлo", "тсo", "виo", "yo", "гю", "хю", "лю", "мю", "ню", "кюю", "сю", "дю", "тлю", "тсю", "вию", "yю", "гв", "хв", "лв", "нв", "кюв", "св", "дв", "тлв", "тсв", "вив", "yв" )
#define OLDNORSE_SYLLABLES 		list("арвеб", "бэр", "вэр", "бор", "гэлк", "гoар", "гхэрскнин", "гжэр", "дерах", "дюте", "кеб", "сарб", "сирб", "хэрв", "харв", "иворн", "же", "кa", "кж", "cю'юр", "кю'юр", "элек", "лар","эмиa", "эник", "мэрск", "нэрск", "oнмэрб", "рев", "рав", "эрк", "рюнэр", "эсэн", "сaх", "тееб", "тюo", "юрбэр", "ефрак", "фэрсбэр", "ехв", "жэр", "скa", "скюми", "евбэр", "жюкбе", "жар", "ми", "мир", "люви", "юевб", "бэрвг", "вэрбар", "ал", "ан", "yэр", "yеyорг", "хю'юн", "гю'юн", "юрсбэр", "норг", "норк", "кэрг", "эрб", "арб", "стэрюбюр", "стюк", "дю'гркар", "эрэн", "рэртбэр", "ребре")
#define EGYPTIAN_SYLLABLES 		list("юра","юре", "нюф", "ниф", "рхa", "рхе", "рхи", "фэнет", "фанaт", "юнерх", "юнирх", "oрхсет", "юрхсет", "юн", "не", "неф", "нaк", "нaф", "рак", "раф", "рю", "ри", "тю", "ти", "тa", "те", "ют", "ит", "рхэр", "рхир", "инет", "юoт","еюнет", "рюнет", "aюнет", "мюн", "мoн", "мин", "ам", "эм", "им", "oкa", "oкеф", "oкиф", "oкюф", "кхa", "oнет", "камa", "юмит", "кхе", "кхюф", "нэм", "ним", "нет", "нит", "рхет", "рхaт", "рхaт", "ом", "ам", "юм", "им", "yют", "yaт", "yит", "еим", "юим", "иэм", "хет", "юминет", "ниетэр", "юмэртэр", "омиэр", "керне", "керхэр", "кюрх", "керх", "кирх", "иеюн", "иaюн", "иoюн", "oнетфэр", "юнетфэр", "энетфэр", "фэрнех", "рхэрнех", "мию", "мих", "мие", "кек")
#define KOREAN_SYLLABLES 		list("гya", "гa", "геo", "гyеo", "гo", "гyo", "гю", "гyю", "гею", "ги", "нa", "нya", "неo", "нyеo", "нo", "нyo", "ню", "нyю", "нею", "ни", "да", "дya", "деo", "дyеo", "до", "дyo", "дю", "дyю", "дею", "ди", "ра", "рya", "реo", "рyеo", "рo", "рyo", "рю", "рyю", "рею", "ри", "ма", "мya", "миo", "мyеo", "мo", "мyo", "мю", "мyю", "мию", "ми", "бa", "бya", "беo", "бyеo", "бo", "бyo", "бю", "бyю", "бею", "би", "сa", "сya", "сеo", "сyеo", "сo", "сyo", "сю", "сyю", "сею", "си", "a", "ya", "еo", "yеo", "o", "yo", "ю", "yю", "ею", "и", "жa", "жya", "жеo", "жyеo", "жo", "жyo", "жю", "жyю", "жею", "жи", "cхa", "cхya", "cхеo", "cхyеo", "cхo", "cхyo", "cхю", "cхyю", "cхею", "cхи", "кa", "кya", "кеo", "кyеo", "кo", "кyo", "кю", "кyю", "кею", "ки", "тa", "тya", "теo", "тyеo", "тo", "тyo", "тю", "тyю", "тею", "ти", "ра", "рya", "реo", "рyеo", "рo", "рyo", "рю", "рyю", "рею", "ри", "хa", "хya", "хеo", "хyеo", "хo", "хyo", "хю", "хyю", "хею", "хи")
#define IROQUOIS_SYLLABLES 		list("a", "гa", "кa", "хa", "лa", "ма", "нa", "хнa", "нaх", "кюa", "с", "сa", "да", "тa", "длa", "тлa", "тсa", "виa", "ya", "е", "ге", "хе", "ле", "ми", "не", "кюе", "се", "де", "те", "тле", "тсе", "вие", "yе", "и", "ги", "хи", "ли", "ми", "ни", "кюи", "си", "ди", "тли", "тси", "твии", "вии", "yи", "ти", "o", "гo", "хo", "лo", "мo", "нo", "кюo", "сo", "до", "тиo", "тсo", "виo", "yo", "ю", "гю", "хю", "лю", "мю", "ню", "кюю", "сю", "дю", "тлю", "тсю", "вию", "yю", "в", "гв", "хв", "лв", "нв", "кюв", "св", "дв", "тлв", "вив", "yв")
#define FILIPINO_SYLLABLES 		list("a", "б", "да", "фa", "гa", "гра", "хa", "хан", "хoн", "кa", "лa", "лaт", "ма", "нa", "нгa", "ра", "рра", "ра", "сa", "сал", "тa", "тра", "виa", "е", "бе", "бре", "де", "дре", "ге", "хе", "ке", "ле", "ми", "не", "ре", "рре", "ре", "се", "те", "тре", "и", "би", "ди", "фи", "ги", "хи", "ки", "ли", "ми", "ни", "ри", "рри", "ри", "си", "ти", "o", "oнг", "oo", "бo", "брo", "до", "дрo", "гo", "хo", "кo", "лo", "мo", "нo", "нгo", "рo", "ррo", "рo", "сo", "тo", "трo", "yo", "ю", "бю", "дю", "гю", "хю", "кю", "лю", "мю", "рю", "yю")
#define ITALIAN_SYLLABLES 		list("ри", "зa", "ре", "рр", "эр", "oн", "и", "ма", "миa", "нa", "вa", "тa", "ра", "гa", "да", "нa", "сa", "лa", "те", "ре", "ге", "де", "не", "се", "ле", "ти", "ри", "ги", "ди", "ни", "си")
#define CHECHEN_SYLLABLES 		list("лa", "ма", "нaкх", "дюкх", "дюy", "лю", "сал", "схи", "схoв", "дансх", "эн", "бе", "кхa", "жa", "бал", "тсa", "мoл", "юсх", "жин", "кхор", "гие", "бюyлсх", "ор", "гa", "тхa", "зан", "дакх", "гасх", "дет", "микх", "сa", "салам", "ал", "кюм", "хa", "aт", "кo", "ди", "сте", "aид")
#define FINNISH_SYLLABLES 		list("a", "ан", "дел", "дес", "эр", "гас", "гo", "хе", "ик", "ил", "жa", "жар", "жэс", "жaт", "кa", "кaи", "кю", "лa", "лас", "лaт", "лэм", "лет", "ли", "лис", "ма", "мал", "мас", "мат", "ми", "мэл", "мэр", "ми", "мин", "мис", "мoит", "мyy", "нэн", "ни", "нин", "нит", "нo", "нос", "o", "oн", "ре", "рет", "рис", "рю", "ра", "ри", "сa", "сэс", "стрюк", "сyy", "тa", "тaю", "те", "тэл", "ти", "тo", "тю", "жар", "тан", "тo", "тoн", "вин", "вoи")

/datum/language/portuguese
	name = "Португальский"
	desc = "На нём говорят любящие море."
	key = "pt"
	colour = "Portuguese"
	flags = RESTRICTED | COMMON_VERBS
	syllables = PORTUGUESE_SYLLABLES
	mutual_intelligibility = list(/datum/language/spanish = 75,/datum/language/french = 35,/datum/language/italian = 10)

/datum/language/danish
	name = "Датский"
	desc = "По звучанию похож на смесь немецкого и скандинавсткого языка - собственно он от них и берёт свои корни."
	key = "dn"
	colour = "danish"
	flags = RESTRICTED | COMMON_VERBS
	syllables = DANISH_SYLLABLES
	mutual_intelligibility = list(/datum/language/french = 10,
	/datum/language/german = 10,
	/datum/language/oldnorse = 25,
	/datum/language/dutch = 10,
	/datum/language/english = 10)

/datum/language/spanish
	name = "Испанский"
	desc = "Мексиканский основной язык."
	key = "sp"
	colour = "Spanish"
	flags = RESTRICTED | COMMON_VERBS
	syllables = SPANISH_SYLLABLES
	mutual_intelligibility = list(/datum/language/portuguese = 50,/datum/language/french = 35,/datum/language/italian = 30)

/datum/language/english
	name = "Английский"
	desc = "Основной язык других языков."
	key = "en"
	colour = "English"
	flags = RESTRICTED | COMMON_VERBS
	syllables = ENGLISH_SYLLABLES
	mutual_intelligibility = list(/datum/language/french = 10,/datum/language/german = 10,/datum/language/dutch = 10)

/datum/language/french
	name = "Французкий"
	desc = "Прекрасный язык."
	key = "fr"
	colour = "French"
	flags = RESTRICTED | COMMON_VERBS
	syllables = FRENCH_SYLLABLES
	mutual_intelligibility = list(/datum/language/english = 10,/datum/language/spanish = 25,/datum/language/portuguese = 10,/datum/language/dutch = 10,/datum/language/italian = 10)

/datum/language/dutch
	name = "Нидерландский"
	desc = "Похож на Датский, но различия существенные между этими языками есть."
	key = "nl"
	colour = "Dutch"
	flags = RESTRICTED | COMMON_VERBS
	syllables = DUTCH_SYLLABLES
	mutual_intelligibility = list(/datum/language/english = 10,/datum/language/german = 40,/datum/language/oldnorse = 15)

/datum/language/carib
	name = "Карибский"
	desc = "Язык далёких земель."
	key = "cb"
	colour = "Carib"
	flags = RESTRICTED | COMMON_VERBS
	syllables = CARIB_SYLLABLES
	mutual_intelligibility = list()


/datum/language/greek
	name = "Греческий"
	desc = "Брат латинского языка."
	key = "gr"
	colour = "Greek"
	flags = RESTRICTED | COMMON_VERBS
	syllables = GREEK_SYLLABLES
	mutual_intelligibility = list(/datum/language/latin = 10)

/datum/language/latin
	name = "Латинский"
	desc = "Дедушка других языков."
	key = "la"
	colour = "Latin"
	flags = RESTRICTED | COMMON_VERBS
	syllables = LATIN_SYLLABLES
	mutual_intelligibility = list(/datum/language/portuguese = 30,
		/datum/language/french = 30,
		/datum/language/spanish = 30,
		/datum/language/italian = 45,
		/datum/language/english = 10,
		/datum/language/dutch = 10)

/datum/language/arab
	name = "Арабский"
	desc = "Язык жителей юга, похож на Египетский."
	key = "ar"
	colour = "Arabic"
	flags = RESTRICTED | COMMON_VERBS
	syllables = ARAB_SYLLABLES
	mutual_intelligibility = list(/datum/language/hebrew = 35, /datum/language/egyptian= 30, /datum/language/chechen= 30)

/datum/language/chechen
	name = "Чеченский"
	desc = "Нихуя не понятно."
	key = "ch"
	colour = "Arabic"
	flags = RESTRICTED | COMMON_VERBS
	syllables = CHECHEN_SYLLABLES
	mutual_intelligibility = list(/datum/language/russian = 5, /datum/language/arab= 30, /datum/language/armenian= 30)

/datum/language/hebrew
	name = "Иврит"
	desc = "На нём когда-то говорит Иисус."
	key = "hb"
	colour = "Hebrew"
	flags = RESTRICTED | COMMON_VERBS
	syllables = HEBREW_SYLLABLES
	mutual_intelligibility = list(/datum/language/arab = 35, /datum/language/egyptian= 30)

/datum/language/japanese
	name = "Японский"
	desc = "Восточный язык, похож на Китайский."
	key = "jp"
	colour = "Japanese"
	flags = RESTRICTED | COMMON_VERBS
	syllables = JAPANESE_SYLLABLES
	mutual_intelligibility = list(/datum/language/chinese = 15)

/datum/language/ainu
	name = "Айнский"
	desc = "Похож на Монгольский."
	key = "ai"
	colour = "Ainu"
	flags = RESTRICTED | COMMON_VERBS
	syllables = AINU_SYLLABLES
	mutual_intelligibility = list(/datum/language/japanese = 15, /datum/language/russian = 15)

/datum/language/russian
	name = "Русский"
	desc = "Да."
	key = "ru"
	colour = "Russian"
	flags = RESTRICTED | COMMON_VERBS
	syllables = RUSSIAN_SYLLABLES
	mutual_intelligibility = list(/datum/language/ukrainian = 35, /datum/language/polish = 10)

/datum/language/ukrainian
	name = "Украинский"
	desc = "🐖"
	key = "uk"
	colour = "Ukrainian"
	flags = RESTRICTED | COMMON_VERBS
	syllables = RUSSIAN_SYLLABLES
	mutual_intelligibility = list(/datum/language/russian = 35, /datum/language/polish = 20)

/datum/language/polish
	name = "Польский"
	desc = "Один из славянских языков."
	key = "pl"
	colour = "Polish"
	flags = RESTRICTED | COMMON_VERBS
	syllables = POLISH_SYLLABLES
	mutual_intelligibility = list(/datum/language/russian = 10, /datum/language/ukrainian = 20)

/datum/language/chinese
	name = "Китайский"
	desc = "Похож на Японский язык."
	key = "cn"
	colour = "Chinese"
	flags = RESTRICTED | COMMON_VERBS
	syllables = JAPANESE_SYLLABLES
	mutual_intelligibility = list(/datum/language/japanese = 15)

/datum/language/german
	name = "Немецкий"
	desc = "Современный скандинаский."
	key = "de"
	colour = "german"
	flags = RESTRICTED | COMMON_VERBS
	syllables = GERMAN_SYLLABLES
	mutual_intelligibility = list(/datum/language/english = 15,/datum/language/dutch = 35,/datum/language/oldnorse = 15)

/datum/language/zulu
	name = "Зулу"
	desc = "Южный язык чернокожих."
	key = "zu"
	colour = "Zulu"
	flags = RESTRICTED | COMMON_VERBS
	syllables = SWAHILI_SYLLABLES
	mutual_intelligibility = list(/datum/language/swahili = 35, /datum/language/egyptian= 10)

/datum/language/swahili
	name = "Суахили"
	desc = "Южный язык чернокожих."
	key = "sw"
	colour = "Swahili"
	flags = RESTRICTED | COMMON_VERBS
	syllables = SWAHILI_SYLLABLES
	mutual_intelligibility = list(/datum/language/zulu = 35, /datum/language/egyptian= 10)

/datum/language/armenian
	name = "Армянский"
	desc = "Язык игроков в нарды."
	key = "ar"
	colour = "Armenian"
	flags = RESTRICTED | COMMON_VERBS
	syllables = ARAB_SYLLABLES
	mutual_intelligibility = list(/datum/language/hebrew = 10, /datum/language/chechen= 30)

/datum/language/vietnamese
	name = "Вьетнамский"
	desc = "Китайский изменёный язык."
	key = "vn"
	colour = "Vietnamese"
	flags = RESTRICTED | COMMON_VERBS
	syllables = VIETNAMESE_SYLLABLES
	mutual_intelligibility = list(/datum/language/chinese = 10)


/datum/language/blackspeech
	name = "Орочий"
	desc = "Победа или смерть!"
	key = "bs"
	colour = "Black Speech"
	flags = RESTRICTED | COMMON_VERBS
	syllables = BLACKSPEECH_SYLLABLES
	mutual_intelligibility = list(/datum/language/oldnorse = 10) //easteregg to Norse god Baldr

/datum/language/ant
	name = "Муравьинный"
	desc = "Чё они пиздят один хуй никто не поймёт."
	key = "an"
	colour = "Antspeak"
	flags = RESTRICTED | COMMON_VERBS
	syllables = ANT_SYLLABLES
	mutual_intelligibility = list()

/datum/language/ape
	name = "Апексовый"
	desc = "На нём говорят макаки и неважно макаки первобытные или из далёкого будущего."
	key = "ap"
	colour = "Ape Speech"
	flags = RESTRICTED | COMMON_VERBS
	syllables = GORILLA_SYLLABLES
	mutual_intelligibility = list()

/datum/language/wolf
	name = "Вой"
	desc = "На нём \"говорят\" волки и похожие на волков существа."
	key = "wo"
	colour = "Wolf Howling"
	flags = RESTRICTED | COMMON_VERBS
	syllables = WOLF_SYLLABLES
	mutual_intelligibility = list()

/datum/language/lizard
	name = "Ящерский"
	desc = "Шипение пресмыкающихся."
	key = "li"
	speech_verb = "шипит"	
	ask_verb = "шипит"
	exclaim_verb = "шипит"
	whisper_verb = "пришёптывает"
	colour = "Lizard Hissing"
	flags = RESTRICTED | COMMON_VERBS
	syllables = HEBREW_SYLLABLES
	mutual_intelligibility = list()

/datum/language/crab
	name = "Клешни"
	desc = "Щёлкаете клешнями и говорите."
	key = "ct"
	speech_verb = "щёлкает"	
	ask_verb = "щёлкает"
	exclaim_verb = "щёлкает"
	whisper_verb = "тихо щёлкает"
	colour = "Clack Tongue"
	flags = RESTRICTED | COMMON_VERBS
	syllables = CRAB_SYLLABLES
	mutual_intelligibility = list()

/datum/language/gaelic
	name = "Шотландский"
	desc = "Гэльский язык."
	key = "ga"
	colour = "Gaelic"
	flags = RESTRICTED | COMMON_VERBS
	syllables = GAELIC_SYLLABLES
	mutual_intelligibility = list()

/datum/language/italian
	name = "Итальянский"
	desc = "Имеет схожесть с Испанским, Французким и Португальским."
	key = "it"
	colour = "ITALIAN"
	flags = RESTRICTED | COMMON_VERBS
	syllables = ITALIAN_SYLLABLES
	mutual_intelligibility = list(/datum/language/spanish = 30,/datum/language/french = 10,/datum/language/portuguese = 10)

/datum/language/inuit
	name = "Инуктитут"
	desc = "Диалекты Канады."
	key = "in"
	colour = "Inuktitut"
	flags = RESTRICTED | COMMON_VERBS
	syllables = INUKTITUT_SYLLABLES
	mutual_intelligibility = list()

/datum/language/cherokee
	name = "Черокский"
	desc = "Изменёный Ирокезкий язык."
	key = "cr"
	colour = "Cherokee"
	flags = RESTRICTED | COMMON_VERBS
	syllables = CHEROKEE_SYLLABLES
	mutual_intelligibility = list()


/datum/language/oldnorse
	name = "Всеобщий"
	desc = "Древнескандинаский язык, дедушка Латинского языка."
	key = "on"
	colour = "Old Norse"
	flags = RESTRICTED | COMMON_VERBS
	syllables = OLDNORSE_SYLLABLES
	mutual_intelligibility = list(/datum/language/german = 20,
	/datum/language/dutch = 15,
	/datum/language/english = 10,
	/datum/language/blackspeech=10,
	/datum/language/danish = 25)

/datum/language/finnish
	name = "Финский"
	desc = "Имеет схожесть с английским и русским языком."
	key = "fi"
	colour = "Finnish"
	flags = RESTRICTED | COMMON_VERBS
	syllables = FINNISH_SYLLABLES
	mutual_intelligibility = list(/datum/language/oldnorse = 25,
	/datum/language/danish = 20,
	/datum/language/russian = 10)

/datum/language/egyptian
    name = "Египтянский"
    desc = "Древний южный язык."
    key = "eg"
    colour = "Egyptian"
    flags = RESTRICTED | COMMON_VERBS
    syllables = EGYPTIAN_SYLLABLES
    mutual_intelligibility = list(/datum/language/hebrew = 30,
	/datum/language/swahili = 10,
	/datum/language/arab = 30,
	/datum/language/zulu = 10)

/datum/language/korean
    name = "Корейский"
    desc = "На нём говорят фанаты k-pop."
    key = "ko"
    colour = "Korean"
    flags = RESTRICTED | COMMON_VERBS
    syllables = KOREAN_SYLLABLES
    mutual_intelligibility = list(/datum/language/chinese = 15, /datum/language/japanese = 15)

/datum/language/iroquois
    name = "Изокезкий"
    desc = "Язык племён индейцев."
    key = "ir"
    colour = "Iroquois"
    flags = RESTRICTED | COMMON_VERBS
    syllables = IROQUOIS_SYLLABLES
    mutual_intelligibility = list(/datum/language/inuit = 10)

/datum/language/filipino
    name = "Филипинский"
    desc = "Состоит из Испанского языка."
    key = "ph"
    colour = "Filipino"
    flags = RESTRICTED | COMMON_VERBS
    syllables = FILIPINO_SYLLABLES
    mutual_intelligibility = list(/datum/language/spanish = 40)

/datum/language/redmenian
	name = "Redmenian"
	desc = "The language of Redmenia."
	key = "rd"
	colour = "Redmenian"
	flags = RESTRICTED | COMMON_VERBS
	syllables = ARAB_SYLLABLES
	mutual_intelligibility = list(/datum/language/blugoslavian = 10)

/datum/language/blugoslavian
	name = "Blugoslavian"
	desc = "The language of Blugoslavia."
	key = "bl"
	colour = "Blugoslavian"
	flags = RESTRICTED | COMMON_VERBS
	syllables = RUSSIAN_SYLLABLES
	mutual_intelligibility = list(/datum/language/redmenian = 10)

/datum/language/greenistani
	name = "Greenistani"
	desc = "The language of Greenistan."
	key = "gn"
	colour = "Greenistani"
	flags = RESTRICTED | COMMON_VERBS
	syllables = CHECHEN_SYLLABLES
	mutual_intelligibility = list()
